'use client';
import NavPath from '@/app/components/NavPath/NavPath';
import Image from 'next/image';
import styles from './PrivacyPolicyContent.module.css';
type Props = {
    dictionary: any;
  };
const PrivacyPolicyContent = ({ dictionary }: Props) =>  {
    return (
        <section className={styles.sectionPrivacyPolicy}>
            <div className={styles.PrivacyPolicyContent}>
                <NavPath />
                <div className={styles.titleContainer}>
                    <h1>Про нас</h1>
                </div>
                <p className={`${styles.sectionPara}`}>
                    Ми, компанія [Назва компанії], приділяємо надзвичайну увагу та серйозно ставимося до захисту вашої конфіденційності та персональних даних. У нашій діяльності ми завжди прагнемо забезпечити найвищий рівень безпеки та прозорості у відносинах із нашими користувачами. Ця Політика конфіденційності детально пояснює, як саме ми збираємо, використовуємо, зберігаємо та захищаємо ваші персональні дані при взаємодії з нашим веб-сайтом або при здійсненні покупок через нього. Ми уважно слідкуємо за тим, щоб ваша персональна інформація не потрапила в руки третіх осіб без вашої згоди та використовуємо лише ті дані, які необхідні для надання вам наших послуг та покращення вашого досвіду. Наша компанія строго дотримується всіх вимог законодавства щодо захисту персональної інформації, забезпечуючи відповідність нашим практикам та політикам щодо конфіденційності найсучаснішим стандартам безпеки. Ми зобов'язуємося постійно вдосконалювати наші процедури захисту даних і надавати вам всю необхідну інформацію для того, щоб ви могли почуватися впевнено, знаючи, що ваша конфіденційність є нашою головною пріоритетною задачею.        </p>
                <p className={`${styles.sectionPara}`}>
                    Ми збираємо інформацію, яку ви надаєте нам безпосередньо через наш веб-сайт, щоб забезпечити вам найкращий досвід під час використання наших послуг. Ця інформація може включати, зокрема, особисті дані, такі як ваше ім’я, прізвище, адреса електронної пошти, номер телефону, а також платіжні реквізити, інформацію про способи оплати та дані доставки. Всі ці дані необхідні для того, щоб ми могли ефективно виконувати свої зобов'язання перед вами, зокрема для обробки ваших замовлень, організації своєчасної доставки товарів, а також для надання підтримки клієнтів у разі необхідності. Крім того, ми використовуємо ці дані для покращення якості наших послуг, персоналізації вашого досвіду, а також для забезпечення безпеки ваших операцій та захисту від шахрайства. Зібрані від вас дані допомагають нам краще розуміти ваші потреби та вподобання, що дозволяє нам пропонувати більш зручні та відповідні пропозиції та рекомендації. Ми прагнемо зробити вашу взаємодію з нашим веб-сайтом максимально комфортною та безпечною, тому ваші дані використовуються виключно з метою забезпечення якісного обслуговування та підтримки.        </p>
                <p className={`${styles.sectionPara}`}>
                    Ми використовуємо ваші персональні дані для кількох важливих і необхідних цілей, щоб забезпечити максимальний комфорт та зручність при використанні наших послуг. По-перше, ці дані необхідні для того, щоб ефективно обробити ваші замовлення, організувати своєчасну доставку товарів і забезпечити належний рівень комунікації з вами на всіх етапах процесу. Ми також використовуємо ваші персональні дані для надання підтримки клієнтів, щоб оперативно відповідати на ваші запити, вирішувати будь-які питання та пропонувати можливі рішення в разі виникнення проблем. Зібрані дані дозволяють нам не тільки ефективно виконувати наші зобов'язання перед вами, але й допомагають нам постійно вдосконалювати якість наших послуг. Вони також дають змогу надавати вам персоналізовані рекомендації, спеціальні пропозиції або акції, що ґрунтуються на вашій поведінці та уподобаннях під час використання нашого веб-сайту. Таким чином, ми прагнемо зробити ваш досвід з нами комфортним.        </p>
                <p className={`${styles.sectionPara}`}>
                    Ми серйозно ставимося до захисту ваших персональних даних і докладаємо максимум зусиль, щоб гарантувати їхню безпеку. Для цього ми застосовуємо різноманітні технічні та організаційні заходи, спрямовані на захист ваших даних від несанкціонованого доступу, втрати, зміни або знищення. Всі дані, які ви передаєте через наш веб-сайт, обробляються з використанням передових технологій безпеки, таких як шифрування, що забезпечує їхню конфіденційність під час передачі через інтернет. Окрім цього, ми постійно оновлюємо наші системи захисту та застосовуємо інші методи, такі як багаторівнева аутентифікація та моніторинг безпеки, щоб забезпечити додатковий рівень захисту. Всі ці заходи покликані гарантувати, що ваша персональна інформація буде надійно захищена від будь-яких загроз.        </p>
                <p className={`${styles.sectionPara}`}>
                    Ми не передаємо ваші персональні дані третім особам, за винятком випадків, коли це є необхідним для виконання наших зобов'язань перед вами. Наприклад, ми можемо передавати вашу інформацію компаніям, які займаються доставкою товарів, або платіжним системам, що використовуються для обробки ваших платежів. Ми забезпечуємо, щоб у таких випадках дані передавались лише тим організаціям, які прямо залучені до процесу виконання вашого замовлення та які мають відповідні стандарти безпеки для захисту вашої інформації. Однак, ми завжди намагаємося мінімізувати кількість осіб чи компаній, які мають доступ до ваших персональних даних, і забезпечуємо, щоб вони використовували ці дані лише для визначених цілей, не порушуючи вашу конфіденційність.
                </p>
                <p className={`${styles.sectionPara}`}>
                    Ми залишаємо за собою право змінювати цю Політику конфіденційності у будь-який час. У разі внесення змін ми опублікуємо оновлену версію на нашому сайті, і ці зміни набудуть чинності з моменту публікації. Ми рекомендуємо вам періодично перевіряти цю сторінку для того, щоб бути в курсі всіх оновлень.
                </p>
            </div>
        </section>
    );
};

export default PrivacyPolicyContent;