'use client';
import NavPath from '@/app/components/NavPath/NavPath';
import Image from 'next/image';
import styles from './AboutContent.module.css';
const AboutContent: React.FC = () => {
  return (
    <section className={styles.sectionAbout}>

      <div className={styles.heroSection}></div>
      <div className={styles.aboutContent}>
      <NavPath />
        <div className={styles.titleContainer}>
          <h1>Про нас</h1>
        </div>
        <p className={`${styles.sectionPara}`}>
          Компанія MOTOALLEGRO.NET працює на ринку з 2018 року та спеціалізується на доставці автозапчастин для
          іноземних автомобілів. За цей час ми зарекомендували себе як надійний партнер, надаючи зручний сервіс
          підбору та доставки запчастин з Європи, а також вигідні ціни і постійно оновлюваний асортимент.
        </p>
        <p className={`${styles.sectionPara}`}>
          Ми співпрацюємо з численними постачальниками в Польщі, що дозволяє нам пропонувати клієнтам лише
          оригінальні автозапчастини високої якості. Наші клієнти отримують доступ до широкого асортименту товарів,
          включаючи запчастини для автомобілів різних марок та моделей. Завдяки регулярним поставкам із Європи, ми
          гарантуємо швидку доставку та точність виконання замовлень.
        </p>
        <h2 className={`${styles.sectionSubtitle}`}>Наші переваги:</h2>
        <ul className={styles.advantagesList}>
          <li className={`${styles.sectionPara}`}>
            Оригінальні автозапчастини за оптимальними цінами. Ми пропонуємо тільки сертифіковані продукти, які
            відповідають найвищим стандартам якості.
          </li>
          <li className={`${styles.sectionPara}`}>
            Програма лояльності для постійних клієнтів. Ми цінуємо кожного нашого клієнта і пропонуємо вигідні
            умови для тих, хто співпрацює з нами на постійній основі.
          </li>
          <li className={`${styles.sectionPara}`}>
            Регулярні поставки з Європи в Україну. Завдяки налагодженій логістиці, ми забезпечуємо стабільні
            поставки запчастин, що дозволяє оперативно задовольняти потреби наших клієнтів.
          </li>
          <li className={`${styles.sectionPara}`}>
            Співпраця з провідними постачальниками в Польщі. Ми працюємо лише з перевіреними партнерами, що
            дозволяє гарантувати високу якість усіх товарів, які ми доставляємо.
          </li>
          <li className={`${styles.sectionPara}`}>
            Зручний сервіс підбору та доставки запчастин. На нашому сайті ви зможете легко знайти необхідні
            запчастини, а також отримати консультації від наших фахівців, які допоможуть вибрати правильний товар.
          </li>
          <li className={`${styles.sectionPara}`}>
            Професійні консультанти, які допоможуть у виборі запчастин. Наші спеціалісти мають великий досвід у
            сфері автозапчастин і завжди готові допомогти вам знайти саме ту деталь, яка відповідає вимогам вашого
            автомобіля.
          </li>
          <li className={`${styles.sectionPara}`}>
            Індивідуальний підхід до кожного клієнта. Ми прагнемо задовольнити потреби кожного клієнта та зробити
            співпрацю максимально комфортною.
          </li>
        </ul>
        <h2 className={`${styles.sectionSubtitle}`}>Наші правила:</h2>
        <ul className={styles.rulesList}>
          <li className={`${styles.sectionPara}`}>
            Клієнт завжди правий. Ми цінуємо наших клієнтів і завжди готові йти на зустріч для вирішення будь-яких
            питань.
          </li>
          <li className={`${styles.sectionPara}`}>
            Ми гарантуємо швидке та якісне обслуговування. Швидкість і точність – це основа нашої роботи.
          </li>
        </ul>
        <p className={`${styles.sectionPara}`}>
          Зверніть увагу, що ми не є продавцями товарів або лотів з аукціонів allegro.pl. Усі товари на нашому сайті
          належать різним фірмам, підприємцям, виробникам та приватним особам з Польщі, які розміщують свої
          пропозиції на різних платформах. Ми лише забезпечуємо доставку цих запчастин з Польщі в Україну та інші
          країни, надаючи зручний сервіс підбору і транспортування.
        </p>
        <p className={`${styles.sectionPara}`}>
          Компанія MOTOALLEGRO.NET допоможе вам знайти необхідні автозапчастини для вашого автомобіля та
          забезпечить їх швидку доставку без зайвих клопотів. Ми завжди прагнемо бути на крок попереду, що дозволяє
          нам залишатися лідерами на ринку доставок автозапчастин з Європи.
        </p>
      </div>
    </section>
  );
};

export default AboutContent;