'use client';
import NavPath from '@/app/components/NavPath/NavPath';
import Image from 'next/image';
import styles from './AboutContent.module.css';
const AboutContent: React.FC = () => {
  return (
    <section className={styles.sectionAbout}>

      <div className={styles.heroSection}></div>
      <div className={styles.aboutContent}>
        <NavPath />
        <div className={styles.titleContainer}>
          <h1>Про нас</h1>
        </div>
        <p className={`${styles.sectionPara}`}>
          Компанія MOTOALLEGRO.NET успішно працює на ринку з 2018 року та спеціалізується на доставці автозапчастин для іноземних автомобілів різних марок і моделей. За ці роки ми змогли зарекомендувати себе як надійний і відповідальний партнер, який пропонує високоякісні запчастини, конкурентоспроможні ціни та бездоганний сервіс. Ми створили зручну систему підбору та доставки деталей, що дозволяє нашим клієнтам отримувати необхідні автозапчастини швидко, безпечно та без зайвих труднощів. Завдяки тісній співпраці з європейськими постачальниками, ми регулярно оновлюємо наш асортимент, гарантуючи доступ до великої кількості оригінальних і якісних деталей. Наші клієнти можуть розраховувати на професійну консультаційну підтримку, що допомагає обрати найбільш оптимальне рішення для їхнього автомобіля.
        </p>
        <p className={`${styles.sectionPara}`}>
          Ми активно співпрацюємо з численними перевіреними постачальниками в Польщі, що дозволяє нам пропонувати виключно оригінальні автозапчастини від провідних виробників. Асортимент включає комплектуючі для різних типів автомобілів – від легкових машин до комерційного транспорту. Завдяки добре налагодженій логістиці та регулярним поставкам із Європи, ми забезпечуємо оперативну доставку та точність виконання кожного замовлення. Кожен клієнт отримує можливість замовити необхідну запчастину безпосередньо з Європи, що гарантує високу якість продукції та відповідність всім технічним стандартам. Наші фахівці допоможуть підібрати оптимальний варіант з урахуванням ваших побажань та бюджету, а також нададуть повну інформацію щодо характеристик, сумісності та термінів доставки.
        </p>
        <h2 className={`${styles.sectionSubtitle}`}>Наші переваги:</h2>
        <ul className={styles.advantagesList}>
          <li className={`${styles.sectionPara}`}>
            Ми пропонуємо тільки сертифіковані продукти, що відповідають найвищим стандартам якості. Усі запчастини постачаються від офіційних виробників і проходять ретельний контроль перед відправкою клієнту. Завдяки прямій співпраці з перевіреними європейськими постачальниками, ми можемо гарантувати доступні ціни.
          </li>
          <li className={`${styles.sectionPara}`}>
            Ми цінуємо кожного нашого клієнта та прагнемо зробити співпрацю максимально вигідною. Для тих, хто регулярно замовляє у нас автозапчастини, ми розробили гнучку систему знижок і спеціальних пропозицій. Постійні покупці отримують приємні бонуси, що дозволяє суттєво економити на майбутніх замовленнях.
          </li>
          <li className={`${styles.sectionPara}`}>
            Завдяки добре налагодженій логістиці, ми забезпечуємо стабільні поставки автозапчастин, що дозволяє швидко виконувати замовлення клієнтів. Наші партнери в Європі щоденно відправляють запчастини, тому ми можемо гарантувати оперативну доставку без затримок, проблем і додаткових витрат.
          </li>
          <li className={`${styles.sectionPara}`}>
            Ми працюємо тільки з перевіреними виробниками та постачальниками, що дозволяє гарантувати високу якість усіх товарів. Весь товар постачається безпосередньо від європейських дилерів, що виключає ризик придбання підробок або неякісних запчастин, забезпечуючи надійність і довговічність продукції для всіх наших клієнтів.
          </li>
          <li className={`${styles.sectionPara}`}>
            На нашому сайті ви зможете легко знайти необхідні автозапчастини завдяки зручній системі пошуку та фільтрів. Якщо у вас виникнуть труднощі, наші фахівці завжди допоможуть підібрати правильну деталь для вашого автомобіля. Ми подбаємо про швидку доставку, щоб ви могли отримати замовлення у найкоротші терміни.
          </li>
          <li className={`${styles.sectionPara}`}>
            Наші експерти мають багаторічний досвід у сфері автозапчастин і завжди готові надати професійну консультацію. Вони допоможуть вам обрати оптимальний варіант з урахуванням ваших потреб, моделі авто, бюджету, технічних характеристик, якості деталей та умов експлуатації вашого транспортного засобу.
          </li>
          <li className={`${styles.sectionPara}`}>
            Ми прагнемо забезпечити максимально комфортну співпрацю та знайти рішення для кожного клієнта. Якщо у вас є особливі вимоги чи запитання – ми завжди готові допомогти та запропонувати найкращі варіанти. Наша мета – зробити покупку автозапчастин швидкою, зручною, вигідною та безпечною для вас!
          </li>
        </ul>
        <h2 className={`${styles.sectionSubtitle}`}>Наші правила:</h2>
        <ul className={styles.rulesList}>
          <li className={`${styles.sectionPara}`}>
            Клієнт завжди правий, і для нас немає нічого важливішого, ніж задоволеність наших клієнтів. Ми прагнемо створювати найкращий сервіс, забезпечуючи індивідуальний підхід до кожного клієнта. Наша команда завжди готова вислухати ваші побажання, відповісти на всі запитання та знайти оптимальне рішення навіть у найскладніших ситуаціях. Ми гарантуємо швидке та якісне обслуговування, адже розуміємо, наскільки важливими є ваш час і комфорт.
          </li>
          <li className={`${styles.sectionPara}`}>
            Швидкість і точність – це основа нашої роботи, тому ми докладаємо максимум зусиль, щоб кожне ваше звернення було опрацьоване без затримок і з найвищим рівнем професіоналізму. Наша місія – забезпечити вам бездоганний сервіс, який перевершить ваші очікування. Ми працюємо над тим, щоб кожна взаємодія з нами залишала тільки приємні враження, а ви відчували впевненість у своєму виборі. Ваш комфорт і задоволеність – наш головний пріоритет!
          </li>
        </ul>
        <p className={`${styles.sectionPara}`}>
          Зверніть увагу, що ми не є продавцями товарів або лотів з аукціонів allegro.pl. Усі товари на нашому сайті належать різним фірмам, підприємцям, виробникам та приватним особам з Польщі, які розміщують свої пропозиції на різних платформах. Ми не маємо власного товарного асортименту і не займаємося безпосереднім продажем, а лише забезпечуємо доставку цих автозапчастин з Польщі в Україну та інші країни. Наша компанія надає зручний сервіс підбору та транспортування запчастин.
        </p>
        <p className={`${styles.sectionPara}`}>
          Ми гарантуємо, що наші послуги з доставки здійснюються на високому рівні, швидко та без зайвих труднощів для вас. Компанія MOTOALLEGRO.NET прагне стати вашим надійним партнером у пошуку та доставці автозапчастин, надаючи вам можливість зекономити час і гроші. Завдяки нашій досвідченій команді та добре налагодженим логістичним процесам, ми можемо забезпечити своєчасне отримання товару з Польщі. Наше прагнення бути на крок попереду дозволяє нам залишатися лідерами на ринку доставок автозапчастин з Європи. Ми працюємо безпосередньо з постачальниками, що забезпечує вам вигідні ціни та високу якість товарів.
        </p>
      </div>
    </section>
  );
};

export default AboutContent;