'use client';
import NavPath from '@/app/components/NavPath/NavPath';
import Image from 'next/image';
import styles from './GuaranteesContent.module.css';

type Props = {
  dictionary: any;
};

const GuaranteesContent = ({ dictionary }: Props) => {
  return (
    <section className={styles.guaranteesSection}>
      <div className={styles.guaranteesContent}>
        <NavPath />
        <div className={styles.guaranteesTitle}>
          <h1>Гарантія</h1>
        </div>
        <p>
        Після доставки товару на наш склад, кожна запчастина, замовлена Вами перед відправкою в Україну, проходить ретельну перевірку. Ми здійснюємо зовнішній огляд на наявність пошкоджень, дефектів або будь-яких відмінностей від опису лота. Якщо виявлено які-небудь недоліки або неузгоджені моменти, наші менеджери негайно зв’язуються з Вами для вирішення ситуації. Крім того, ми робимо додаткові фото товару, щоб у Вас була повна інформація про стан автозапчастини.
        </p>
        <p>
        Ми працюємо тільки з перевіреними і надійними постачальниками в Польщі, що гарантує високу якість товарів. Всі запчастини, які ми купуємо, проходять серйозний контроль перед тим, як потрапити до Вас.
        </p>
        <p>
        Гарантія на перевірку автозапчастин складає до 5-ти днів з моменту їх отримання. Протягом цього часу Ви можете звернутися до нас для погодження усіх нюансів і вирішення можливих питань.
        </p>
        <p>
        MOTOALLEGRO — це Ваш надійний партнер у підборі та купівлі автозапчастин. Наші фахівці завжди готові допомогти Вам знайти необхідні деталі, проконсультувати по вибору, а також забезпечити надійну доставку в Україну. Ми піклуємося про наших клієнтів і гарантуємо, що з нами Ви отримуєте тільки найкращий сервіс та якісні автозапчастини для Вашого транспорту!
        </p>
      </div>
    </section>
  );
};

export default GuaranteesContent;