'use client';
import NavPath from '@/app/components/NavPath/NavPath';
import Image from 'next/image';
import styles from './GuaranteesContent.module.css';

type Props = {
  dictionary: any;
};

const GuaranteesContent = ({ dictionary }: Props) => {
  return (
    <section className={styles.guaranteesSection}>
      <div className={styles.heroSection}></div>
      <div className={styles.guaranteesContent}>
        <NavPath />
        <div className={styles.guaranteesTitle}>
          <h1>Гарантія</h1>
        </div>
        <p>
        Після того як автозапчастини доставлені на наш склад, ми ретельно перевіряємо кожну деталь, щоб забезпечити їх високу якість перед відправкою в Україну. Кожен товар проходить зовнішній огляд на наявність пошкоджень, дефектів чи будь-яких відмінностей від опису лота. Якщо виявляються будь-які недоліки або невідповідності, наші менеджери оперативно зв’язуються з вами, щоб вирішити ситуацію в найкоротші терміни. Ми також робимо додаткові фото кожної автозапчастини, щоб ви могли отримати повну і точну інформацію про її стан, що дає вам впевненість у правильності покупки та допомагає уникнути непорозумінь і можливих проблем.
        </p>
        <p>
        Наша компанія співпрацює тільки з перевіреними постачальниками в Польщі, що дозволяє нам гарантувати високу якість усіх автозапчастин. Всі товари, що надходять на наш склад, проходять серйозний контроль якості на етапі закупівлі. Це означає, що кожна деталь, яку ми пропонуємо, відповідає міжнародним стандартам і готова до використання без додаткових проблем. Ми ретельно перевіряємо не тільки наявність дефектів, а й відповідність запчастини до технічних характеристик вашого транспортного засобу, що забезпечує їхню сумісність, довговічність, ефективність, надійність і безпеку під час експлуатації в різних умовах.
        </p>
        <p>
        Наша гарантія на перевірку автозапчастин становить до 5-ти днів з моменту їх отримання. Протягом цього періоду ви можете звертатися до нас для погодження усіх нюансів, обговорення можливих питань або вирішення проблемних ситуацій. Якщо ви виявите будь-які дефекти або проблеми з товаром, ми готові повернути гроші або обміняти товар на інший, що повністю відповідає вашим вимогам. Ми прагнемо, щоб наші клієнти завжди були задоволені якістю і сервісом, який ми надаємо.
        </p>
        <p>
        MOTOALLEGRO — це ваш надійний партнер у підборі та купівлі автозапчастин. Ми завжди готові допомогти вам знайти необхідні деталі для вашого автомобіля, надати консультації по вибору найкращої запчастини та забезпечити її доставку в Україну в найкоротші терміни. Наша компанія піклується про своїх клієнтів, тому ми гарантуємо, що працюємо тільки з високоякісною продукцією, що відповідає усім стандартам. Крім того, ми забезпечуємо надійний та швидкий процес доставки, що дозволяє вам безперешкодно отримати необхідні автозапчастини для ремонту та обслуговування вашого транспорту, зберігаючи при цьому високу ефективність і безпеку.
        </p>
      </div>
    </section>
  );
};

export default GuaranteesContent;
