'use client';
import NavPath from '@/app/components/NavPath/NavPath';
import Image from 'next/image';
import styles from './PaymentDeliveryContent.module.css';

type Props = {
  dictionary: any;
};

const PaymentDeliveryContent = ({ dictionary }: Props) => {
  return (
    <section className={styles.paymentSection}>
      <div className={styles.paymentContent}>
        <NavPath />
        <div className={styles.paymentTitle}>
          <h1>Оплата і доставка</h1>
        </div>
        <p>
          Шановні клієнти, звертаємо вашу увагу, що ми приймаємо замовлення лише через сайт та за номером, вказаним на ньому!
        </p>
        <img className={styles.paymentImg} src={"/images/delivery.jpg"} alt={""} />
        <h2>Доставка в Україні</h2>
        <ul className={styles.paymentList}>
          <li>
            Доставка по Україні здійснюється кур'єрською службою Нова Пошта.
          </li>
          <li>
            Відправка замовлень через транспортну компанію здійснюється два рази на тиждень: у середу та суботу.
          </li>
          <li>
            Оплата за доставку товару Нова Пошта здійснюється покупцем.
          </li>
          <li>
            Товар, придбаний у нас, страхують на Новій пошті на суму, еквівалентну його вартості. Тому при отриманні товару одержувач повинен перевірити його безпосередньо у відділенні транспортної компанії.
          </li>
          <p>
            Якщо будуть виявлені пошкодження, які виникли під час перевезення замовлення, необхідно скласти акт прийому-передачі та оформити претензію. Без цих документів не буде виплачена компенсація за пошкоджений товар.
          </p>
        </ul>
        <h2>Термін доставки</h2>
        <ul className={styles.paymentList}>
          <li>
            Весь процес доставки займає від 3-х до 7-ми робочих днів.
          </li>
          
        </ul>
        <p>
            Доставка автозапчастин здійснюється лише після повної або часткової оплати замовлення в розмірі 50% від вартості товару. Це забезпечує гарантію для обох сторін — продавця та покупця, адже ми маємо впевненість у серйозності намірів покупця, а покупець отримує гарантію, що товар буде зарезервовано та доставлено в обумовлені терміни.
          </p>
        <h2>Способи оплати</h2>
        <p>
          Ви можете ознайомитися зі способами оплати, які ми пропонуємо для зручності наших клієнтів.
        </p>
        <img className={styles.paymentImg} src={"/images/visa.jpg"} alt={""}/>
        <ul className={styles.paymentList}>
          <li>
            На карту ПриватБанку – зручний і швидкий спосіб оплати через банківську картку.
          </li>
          <li>
            На розрахунковий рахунок компанії – оплата через банківський переказ на розрахунковий рахунок юридичної особи.
          </li>
        </ul>
        <h2>Гарантія на б/в запчастини</h2>
        <p>
          На б/в запчастини надається лише перевірочна гарантія терміном 5 робочих днів, за умови, що продавець також дає гарантію на перевірку.
          
        </p>
        <p>
          Повернення або обмін б/в запчастин можливий лише у таких випадках:
        </p>
        <ol className={styles.paymentNumberList}>
          <li>
            Запчастина не справна або працює не коректно.
          </li>
          <li>
            Запчастина має істотні пошкодження, які не були вказані на фотографіях лота.
          </li>
          <li>
            Запчастина не та, що була вказана в оголошенні.
          </li>
          <li>
            Була обговорена індивідуальна гарантія на повернення.
          </li>
        </ol>
      </div>
    </section>
  );
};

export default PaymentDeliveryContent;